sim/rhoReactingFoam/1000_3_1e-8/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
// 				SETUP
// Chemkin format uses these units:
// 	mol, cm^3, s, K; cal
// OpenFOAM native format uses:
// 	kmol, m^3, s, K; K
// The native format is what this file is using. 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
4
(
    O2
    H2
    H2O
    N2
);

reactions
{
    hydrogenReaction
    {
        type     irreversibleArrheniusReaction;
        reaction "2H2 + O2 = 2H2O";
        //A        7.5e9; // e9
	A	9.9e17; // from new paper
        beta     0;
        //Ta       12995; // Ea/R = (4.794e6 J/kg)/(368.9 J/kg K) 
	Ta	15155; // from new paper
    }
}


// ************************************************************************* //
